## Lesson 2

In [1]:
import numpy as np
import pandas as pd

In [2]:
path = r'Data\OnlineRetail.csv'
df = pd.read_csv(path)

In [3]:
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,539993,22386,JUMBO BAG PINK POLKADOT,10,2011-01-04 10:00:00,1.95,13313.0,United Kingdom
1,539993,21499,BLUE POLKADOT WRAP,25,2011-01-04 10:00:00,0.42,13313.0,United Kingdom
2,539993,21498,RED RETROSPOT WRAP,25,2011-01-04 10:00:00,0.42,13313.0,United Kingdom
3,539993,22379,RECYCLING BAG RETROSPOT,5,2011-01-04 10:00:00,2.10,13313.0,United Kingdom
4,539993,20718,RED RETROSPOT SHOPPER BAG,10,2011-01-04 10:00:00,1.25,13313.0,United Kingdom

In [4]:
url = r"https://raw.githubusercontent.com/ntlong-NEU/DSEB65B-DataPre-Visual/refs/heads/main/Data/OnlineRetail.csv"
pd.read_csv(url)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,539993,22386,JUMBO BAG PINK POLKADOT,10,2011-01-04 10:00:00,1.95,13313.0,United Kingdom
1,539993,21499,BLUE POLKADOT WRAP,25,2011-01-04 10:00:00,0.42,13313.0,United Kingdom
2,539993,21498,RED RETROSPOT WRAP,25,2011-01-04 10:00:00,0.42,13313.0,United Kingdom
3,539993,22379,RECYCLING BAG RETROSPOT,5,2011-01-04 10:00:00,2.10,13313.0,United Kingdom
4,539993,20718,RED RETROSPOT SHOPPER BAG,10,2011-01-04 10:00:00,1.25,13313.0,United Kingdom
...,...,...,...,...,...,...,...,...
203417,558637,22032,BOTANICAL LILY GREETING CARD,12,2011-06-30 20:08:00,0.42,17891.0,United Kingdom
203418,558637,22028,PENNY FARTHING BIRTHDAY CARD,12,2011-06-30 20:08:00,0.42,17891.0,United Kingdom
203419,558637,22033,BOTANICAL ROSE GREETING CARD,12,2011-06-30 20:08:00,0.42,17891.0,United Kingdom
203420,558637,22029,SPACEBOY BIRTHDAY CARD,12,2011-06-30 20:08:00,0.42,17891.0,United Kingdom
203421,558637,22024,RAINY LADIES BIRTHDAY CARD,12,2011-06-30 20:08:00,0.42,17891.0,United Kingdom

In [5]:
df.head(10)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,539993,22386,JUMBO BAG PINK POLKADOT,10,2011-01-04 10:00:00,1.95,13313.0,United Kingdom
1,539993,21499,BLUE POLKADOT WRAP,25,2011-01-04 10:00:00,0.42,13313.0,United Kingdom
2,539993,21498,RED RETROSPOT WRAP,25,2011-01-04 10:00:00,0.42,13313.0,United Kingdom
3,539993,22379,RECYCLING BAG RETROSPOT,5,2011-01-04 10:00:00,2.10,13313.0,United Kingdom
4,539993,20718,RED RETROSPOT SHOPPER BAG,10,2011-01-04 10:00:00,1.25,13313.0,United Kingdom
5,539993,85099B,JUMBO BAG RED RETROSPOT,10,2011-01-04 10:00:00,1.95,13313.0,United Kingdom
6,539993,20682,RED RETROSPOT CHILDRENS UMBRELLA,6,2011-01-04 10:00:00,3.25,13313.0,United Kingdom
7,539993,22961,JAM MAKING SET PRINTED,12,2011-01-04 10:00:00,1.45,13313.0,United Kingdom
8,539993,22667,RECIPE BOX RETROSPOT,6,2011-01-04 10:00:00,2.95,13313.0,United Kingdom
9,539993,22898,CHILDRENS APRON APPLES DESIGN,8,2011-01-04 10:00:00,1.95,13313.0,United Kingdom

In [7]:
df.tail(2)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
203420,558637,22029,SPACEBOY BIRTHDAY CARD,12,2011-06-30 20:08:00,0.42,17891.0,United Kingdom
203421,558637,22024,RAINY LADIES BIRTHDAY CARD,12,2011-06-30 20:08:00,0.42,17891.0,United Kingdom

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 203422 entries, 0 to 203421
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    203422 non-null  object
 1   StockCode    203422 non-null  object
 2   Description  202623 non-null  object
 3   Quantity     203422 non-null  int64
 4   InvoiceDate  203422 non-null  object
 5   UnitPrice    203422 non-null  float64
 6   CustomerID   150039 non-null  float64
 7   Country      203422 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 12.4+ MB

In [10]:
type(df['InvoiceDate'][1])

str

In [11]:
# First, you may need to install the library:
#!pip install yfinance
import yfinance as yf

In [12]:
# Fetch Apple stock data ('AAPL') from Yahoo Finance
aapl = yf.download('AAPL', start='2023-01-01', end='2023-12-31')
aapl.head()

YF.download() has changed argument auto_adjust default to True

[*********************100%***********************]  1 of 1 completed

Price            Close        High         Low        Open     Volume
Ticker            AAPL        AAPL        AAPL        AAPL       AAPL
Date
2023-01-03  123.330650  129.079567  122.443165  128.468194  112117500
2023-01-04  124.602707  126.870724  123.340509  125.125335   89113600
2023-01-05  123.281342  125.993097  123.024963  125.361998   80962700
2023-01-06  127.817352  128.478033  123.153137  124.257564   87754700
2023-01-09  128.339981  131.554653  128.083602  128.655538   70790800

In [13]:
df.describe()

            Quantity      UnitPrice     CustomerID
count  203422.000000  203422.000000  150039.000000
mean        9.585684       4.877820   15240.234832
std       240.921315     113.686676    1717.658493
min    -74215.000000       0.000000   12346.000000
25%         1.000000       1.250000   13791.000000
50%         3.000000       2.100000   15061.000000
75%        10.000000       4.130000   16771.000000
max     74215.000000   38970.000000   18287.000000

In [15]:
df[df['UnitPrice']==0]

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
17,539994,22830,NaN,-1,2011-01-04 10:09:00,0.0,NaN,United Kingdom
18,539995,85064,NaN,-12,2011-01-04 10:12:00,0.0,NaN,United Kingdom
19,539996,21784,NaN,-10,2011-01-04 10:12:00,0.0,NaN,United Kingdom
20,539997,84689,NaN,5,2011-01-04 10:15:00,0.0,NaN,United Kingdom
21,539998,84675,NaN,2,2011-01-04 10:16:00,0.0,NaN,United Kingdom
...,...,...,...,...,...,...,...,...
200909,558457,21147,?,-95,2011-06-29 13:59:00,0.0,NaN,United Kingdom
201042,558464,35966,NaN,-20,2011-06-29 15:17:00,0.0,NaN,United Kingdom
201779,558476,84597B,damages,-6,2011-06-29 16:04:00,0.0,NaN,United Kingdom
201780,558477,84597C,NaN,-1,2011-06-29 16:04:00,0.0,NaN,United Kingdom
201917,558520,21896,NaN,-38,2011-06-30 10:25:00,0.0,NaN,United Kingdom

In [14]:
df[df["Quantity"]<0]

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
17,539994,22830,NaN,-1,2011-01-04 10:09:00,0.00,NaN,United Kingdom
18,539995,85064,NaN,-12,2011-01-04 10:12:00,0.00,NaN,United Kingdom
19,539996,21784,NaN,-10,2011-01-04 10:12:00,0.00,NaN,United Kingdom
22,539999,20892,NaN,-1,2011-01-04 10:16:00,0.00,NaN,United Kingdom
23,540000,84499,NaN,-9,2011-01-04 10:17:00,0.00,NaN,United Kingdom
...,...,...,...,...,...,...,...,...
201945,C558531,22424,ENAMEL BREAD BIN CREAM,-1,2011-06-30 11:31:00,12.75,15039.0,United Kingdom
202318,C558553,23170,REGENCY TEA PLATE ROSES,-576,2011-06-30 12:44:00,1.45,17949.0,United Kingdom
202427,C558559,20749,ASSORTED COLOUR MINI CASES,-1,2011-06-30 13:20:00,7.95,17648.0,United Kingdom
202627,C558575,22693,GROW A FLYTRAP OR SUNFLOWER IN TIN,-24,2011-06-30 14:58:00,1.25,12674.0,France
203075,C558615,21845,DAIRY MAID STRIPE MUG,-4,2011-06-30 16:20:00,0.79,17719.0,United Kingdom